iNavFlight/inav/lib/main/STM32H7/Drivers/BSP/STM32H7B3I-EVAL/stm32h7b3i_eval.c
/**
  ******************************************************************************
  * @file    stm32h7b3i_eval.c
  * @author  MCD Application Team
  * @brief   This file provides a set of firmware functions to manage
  *          LEDs
  *          push-buttons
  *          Joystick
  *          POT
  *          COM ports
  *          available on STM32H7B3I_EVAL board(MB1331) from STMicroelectronics.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2019 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32h7b3i_eval.h"
#if (USE_BSP_IO_CLASS > 0)
#include "stm32h7b3i_eval_io.h"
#endif

/** @addtogroup BSP
  * @{
  */

/** @addtogroup STM32H7B3I_EVAL
  * @{
  */

/** @defgroup STM32H7B3I_EVAL_LOW_LEVEL LOW LEVEL
  * @{
  */

/** @defgroup STM32H7B3I_EVAL_LOW_LEVEL_Private_TypesDefinitions LOW LEVEL Private Types Definitions
  * @{
  */
typedef void (* BSP_EXTI_LineCallback) (void);
/**
  * @}
  */

/** @defgroup STM32H7B3I_EVAL_LOW_LEVEL_Private_FunctionPrototypes  LOW LEVEL Private Function Prototypes
  * @{
  */
static void BUTTON_WAKEUP_EXTI_Callback(void);
static void BUTTON_TAMPER_EXTI_Callback(void);
static void BUTTON_USER_EXTI_Callback(void);
#if (USE_BSP_COM_FEATURE > 0)
static void USART1_MspInit(UART_HandleTypeDef *huart);
static void USART1_MspDeInit(UART_HandleTypeDef *huart);
#endif
#if (USE_BSP_POT_FEATURE > 0)
static void ADC1_MspInit(ADC_HandleTypeDef *hadc);
static void ADC1_MspDeInit(ADC_HandleTypeDef *hadc);
#endif

#if (USE_BSP_IO_CLASS > 0)
static void JOY1_UP_EXTI_Callback(void);
static void JOY1_DOWN_EXTI_Callback(void);
static void JOY1_LEFT_EXTI_Callback(void);
static void JOY1_RIGHT_EXTI_Callback(void);
static void JOY1_SEL_EXTI_Callback(void);
#endif

/**
  * @}
  */
/** @defgroup STM32H7B3I_EVAL_LOW_LEVEL_Exported_Variables LOW LEVEL Exported Variables
  * @{
  */
EXTI_HandleTypeDef hpb_exti[BUTTONn];
#if (USE_BSP_COM_FEATURE > 0)
UART_HandleTypeDef hcom_uart[COMn];
USART_TypeDef* COM_USART[COMn]   = {COM1_UART, COM1_UART};
#endif
#if (USE_BSP_POT_FEATURE > 0)
ADC_HandleTypeDef hpot_adc[POTn];
#endif
/**
  * @}
  */

/** @defgroup STM32H7B3I_EVAL_LOW_LEVEL_Private_Variables LOW LEVEL Private Variables
  * @{
  */
static GPIO_TypeDef* LED_PORT[LEDn] = {
                                       LED1_GPIO_PORT,
#if (USE_BSP_IO_CLASS > 0)
                                       0,
                                       0,
                                       0
#endif
                                      };

static const uint32_t LED_PIN[LEDn] = {LED1_PIN,
#if (USE_BSP_IO_CLASS > 0)
                                       LED2_PIN,
                                       LED3_PIN,
                                       LED4_PIN
#endif
                                      };

static GPIO_TypeDef* BUTTON_PORT[BUTTONn] = {BUTTON_WAKEUP_GPIO_PORT,
                                             BUTTON_TAMPER_GPIO_PORT,
                                             BUTTON_USER_GPIO_PORT
                                            };
static const uint16_t BUTTON_PIN[BUTTONn] = {BUTTON_WAKEUP_PIN,
                                             BUTTON_TAMPER_PIN,
                                             BUTTON_USER_PIN
                                            };
static const IRQn_Type BUTTON_IRQn[BUTTONn] = {BUTTON_WAKEUP_EXTI_IRQn,
                                               BUTTON_TAMPER_EXTI_IRQn,
                                               BUTTON_USER_EXTI_IRQn
                                              };



#if (USE_COM_LOG > 0)
static COM_TypeDef COM_ActiveLogPort = COM1;
#endif

#if (USE_BSP_COM_FEATURE > 0)
  #if (USE_HAL_UART_REGISTER_CALLBACKS == 1)
     static uint32_t IsComMspCbValid[COMn] = {0};
  #endif
#endif

#if (USE_BSP_POT_FEATURE > 0)
  #if (USE_HAL_ADC_REGISTER_CALLBACKS == 1)
     static uint32_t IsPotMspCbValid[POTn] = {0};
  #endif
#endif
#if (USE_BSP_IO_CLASS > 0)
static uint32_t JoyPinsMask;
static GPIO_TypeDef* JOY1_PORT[JOY_KEY_NUMBER] = {JOY1_SEL_GPIO_PORT,
                                                  JOY1_DOWN_GPIO_PORT,
                                                  JOY1_LEFT_GPIO_PORT,
                                                  JOY1_RIGHT_GPIO_PORT,
                                                  JOY1_UP_GPIO_PORT
                                                 };

static const uint16_t JOY1_PIN[JOY_KEY_NUMBER] = {JOY1_SEL_PIN,
                                                  JOY1_DOWN_PIN,
                                                  JOY1_LEFT_PIN,
                                                  JOY1_RIGHT_PIN,
                                                  JOY1_UP_PIN
                                                 };
static EXTI_HandleTypeDef hExtiJoyHandle[JOY_KEY_NUMBER];
#endif
/**
  * @}
  */

/** @defgroup STM32H7B3I_EVAL_LOW_LEVEL_Private_Functions LOW LEVEL Exported Functions
  * @{
  */

  /**
  * @brief  This method returns the STM32H7B3I_EVAL BSP Driver revision
  * @retval version: 0xXYZR (8bits for each decimal, R for RC)
  */
int32_t BSP_GetVersion(void)
{
  return (int32_t)STM32H7B3I_EVAL_BSP_VERSION;
}

/**
  * @brief  This method returns the board name
  * @retval pointer to the board name string
  */
const uint8_t* BSP_GetBoardName(void)
{
  return (uint8_t*)STM32H7B3I_EVAL_BSP_BOARD_NAME;
}

/**
  * @brief  This method returns the board ID
  * @retval pointer to the board name string
  */
const uint8_t* BSP_GetBoardID(void)
{
  return (uint8_t*)STM32H7B3I_EVAL_BSP_BOARD_ID;
}

/**
  * @brief  Configures LED on GPIO.
  * @param  Led LED to be configured.
  *          This parameter can be one of the following values:
  *            @arg  LED1
  *            @arg  LED2
  *            @arg  LED3
  *            @arg  LED4
  * @retval BSP status
  */
int32_t BSP_LED_Init(Led_TypeDef Led)
{
  int32_t ret = BSP_ERROR_NONE;

#if (USE_BSP_IO_CLASS > 0)
  BSP_IO_Init_t io_init_structure;
#endif /* (USE_BSP_IO_CLASS > 0) */
  GPIO_InitTypeDef  gpio_init_structure;

  if(Led == LED1)
  {
   /* Enable the GPIO_LED clock */
   LED1_GPIO_CLK_ENABLE();

   /* Configure the GPIO_LED pin */
   gpio_init_structure.Mode = GPIO_MODE_OUTPUT_PP;
   gpio_init_structure.Pull = GPIO_PULLUP;
   gpio_init_structure.Speed = GPIO_SPEED_FREQ_HIGH;
   gpio_init_structure.Pin = LED_PIN [Led];
   HAL_GPIO_Init(LED_PORT[Led], &gpio_init_structure);
   HAL_GPIO_WritePin(LED_PORT [Led], (uint16_t)LED_PIN[Led], GPIO_PIN_SET);
  }
  else
  {
#if (USE_BSP_IO_CLASS > 0)

   io_init_structure.Pin  = LED_PIN[Led];
   io_init_structure.Pull = IO_PULLUP;
   io_init_structure.Mode = IO_MODE_OUTPUT_PP;
   /* Initialize IO expander */
   if(BSP_IO_Init(0, &io_init_structure) != BSP_ERROR_NONE)
   {
    ret = BSP_ERROR_NO_INIT;
   }
   else
   {
     if(BSP_IO_WritePin(0, LED_PIN[Led], IO_PIN_SET) != BSP_ERROR_NONE)
     {
      ret = BSP_ERROR_NO_INIT;
     }
   }
#endif /* (USE_BSP_IO_CLASS > 0) */
  }

  return ret;
}

/**
  * @brief  DeInit LEDs.
  * @param  Led LED to be configured.
  *          This parameter can be one of the following values:
  *            @arg  LED1
  *            @arg  LED2
  *            @arg  LED3
  *            @arg  LED4
  * @retval BSP status
  */
int32_t BSP_LED_DeInit(Led_TypeDef Led)
{
  int32_t ret = BSP_ERROR_NONE;
#if (USE_BSP_IO_CLASS > 0)
  BSP_IO_Init_t io_init_structure;
#endif /* (USE_BSP_IO_CLASS > 0) */
  GPIO_InitTypeDef  gpio_init_structure;

  if(Led == LED1)
  {
   /* Configure the GPIO_LED pin */
   gpio_init_structure.Pin = LED_PIN [Led];
   HAL_GPIO_WritePin(LED_PORT[Led], (uint16_t)LED_PIN[Led], GPIO_PIN_RESET);

   HAL_GPIO_DeInit(LED_PORT[Led], gpio_init_structure.Pin);
  }
  else
  {
#if (USE_BSP_IO_CLASS > 0)
   if(BSP_IO_WritePin(0, LED_PIN[Led], IO_PIN_RESET) != BSP_ERROR_NONE)
   {
     ret = BSP_ERROR_NO_INIT;
   }
   else
   {
    io_init_structure.Pin  = LED_PIN[Led];
    io_init_structure.Pull = IO_PULLUP;
    io_init_structure.Mode = IO_MODE_OFF;

