iNavFlight/inav/lib/main/STM32H7/Drivers/BSP/STM32H7B3I-EVAL/stm32h7b3i_eval.c
    if(BSP_IO_Init(0, &io_init_structure) != BSP_ERROR_NONE)
    {
     ret = BSP_ERROR_NO_INIT;
    }
   }
#endif /* (USE_BSP_IO_CLASS > 0) */
  }
  return ret;
}

/**
  * @brief  Turns selected LED On.
  * @param  Led LED to be set on
  *          This parameter can be one of the following values:
  *            @arg  LED1
  *            @arg  LED2
  *            @arg  LED3
  *            @arg  LED4
  * @retval BSP status
  */
int32_t BSP_LED_On(Led_TypeDef Led)
{
  int32_t ret;

  if(Led == LED1)
  {
    HAL_GPIO_WritePin (LED_PORT [Led], (uint16_t)LED_PIN [Led], GPIO_PIN_RESET);
    ret = BSP_ERROR_NONE;
  }
  else
  {
#if (USE_BSP_IO_CLASS > 0)
   ret = BSP_IO_WritePin(0, LED_PIN[Led], IO_PIN_RESET);
#else
   ret = BSP_ERROR_FEATURE_NOT_SUPPORTED;
#endif /* (USE_BSP_IO_CLASS > 0) */
  }
  return ret;
}

/**
  * @brief  Turns selected LED Off.
  * @param  Led LED to be set off
  *          This parameter can be one of the following values:
  *            @arg  LED1
  *            @arg  LED2
  *            @arg  LED3
  *            @arg  LED4
  * @retval BSP status
  */
int32_t BSP_LED_Off(Led_TypeDef Led)
{
  int32_t ret;
  if(Led == LED1)
  {
    HAL_GPIO_WritePin (LED_PORT [Led], (uint16_t)LED_PIN [Led], GPIO_PIN_SET);
    ret = BSP_ERROR_NONE;
  }
  else
  {
#if (USE_BSP_IO_CLASS > 0)
   ret = BSP_IO_WritePin(0, LED_PIN[Led], IO_PIN_SET);
#else
   ret = BSP_ERROR_FEATURE_NOT_SUPPORTED;
#endif /* (USE_BSP_IO_CLASS > 0) */
  }
  return ret;
}

/**
  * @brief  Toggles the selected LED.
  * @param  Led LED to be toggled
  *          This parameter can be one of the following values:
  *            @arg  LED1
  *            @arg  LED2
  *            @arg  LED3
  *            @arg  LED4
  * @retval BSP status
  */
int32_t BSP_LED_Toggle(Led_TypeDef Led)
{
  int32_t ret;
  if(Led == LED1)
  {
    HAL_GPIO_TogglePin(LED_PORT[Led], (uint16_t)LED_PIN[Led]);
    ret = BSP_ERROR_NONE;
  }
  else
  {
#if (USE_BSP_IO_CLASS > 0)
   ret = BSP_IO_TogglePin(0, LED_PIN[Led]);
#else
   ret = BSP_ERROR_FEATURE_NOT_SUPPORTED;
#endif /* (USE_BSP_IO_CLASS > 0) */
  }
  return ret;
}

/**
  * @brief  Get the selected LED state.
  * @param  Led LED to be get its state
  *          This parameter can be one of the following values:
  *            @arg  LED1
  *            @arg  LED2
  *            @arg  LED3
  *            @arg  LED4
  * @retval LED status
  */
int32_t BSP_LED_GetState (Led_TypeDef Led)
{
  int32_t ret;

  if(Led == LED1)
  {
   ret = (int32_t)HAL_GPIO_ReadPin (LED_PORT [Led], (uint16_t)LED_PIN [Led]);
  }
  else
  {
#if (USE_BSP_IO_CLASS > 0)
   ret = BSP_IO_ReadPin(0, LED_PIN[Led]);
#else
   ret = BSP_ERROR_FEATURE_NOT_SUPPORTED;
#endif /* (USE_BSP_IO_CLASS > 0) */
  }

  return ret;
}

/**
  * @brief  Configures button GPIO and EXTI Line.
  * @param  Button: Button to be configured
  *          This parameter can be one of the following values:
  *            @arg  BUTTON_USER: User Push Button
  *            @arg  BUTTON_TAMPER: Tamper Push Button
  *            @arg  BUTTON_WAKEUP: Wakeup Push Button
  * @param  ButtonMode Button mode
  *          This parameter can be one of the following values:
  *            @arg  BUTTON_MODE_GPIO: Button will be used as simple IO
  *            @arg  BUTTON_MODE_EXTI: Button will be connected to EXTI line
  *                                    with interrupt generation capability
  * @retval BSP status
  */
int32_t BSP_PB_Init(Button_TypeDef Button, ButtonMode_TypeDef ButtonMode)
{
  GPIO_InitTypeDef gpio_init_structure;
  static BSP_EXTI_LineCallback ButtonCallback[BUTTONn] ={
                                                         BUTTON_WAKEUP_EXTI_Callback,
                                                         BUTTON_TAMPER_EXTI_Callback,
                                                         BUTTON_USER_EXTI_Callback
                                                        };
  static uint32_t  BSP_BUTTON_PRIO [BUTTONn] ={
                                               BSP_BUTTON_WAKEUP_IT_PRIORITY,
                                               BSP_BUTTON_TAMPER_IT_PRIORITY,
                                               BSP_BUTTON_USER_IT_PRIORITY,
                                              };
  static const uint32_t BUTTON_EXTI_LINE[BUTTONn] ={
                                                    BUTTON_WAKEUP_EXTI_LINE,
                                                    BUTTON_TAMPER_EXTI_LINE,
                                                    BUTTON_USER_EXTI_LINE,
                                                   };
   /* Enable the BUTTON clock*/
  if(Button == BUTTON_WAKEUP)
  {
    BUTTON_WAKEUP_GPIO_CLK_ENABLE();
  }
  else if(Button == BUTTON_TAMPER)
  {
    BUTTON_TAMPER_GPIO_CLK_ENABLE();
  }
  else
  {
    BUTTON_USER_GPIO_CLK_ENABLE();
  }
  gpio_init_structure.Pin = BUTTON_PIN [Button];
  gpio_init_structure.Pull = GPIO_NOPULL;
  gpio_init_structure.Speed = GPIO_SPEED_FREQ_HIGH;

  if(Button == BUTTON_TAMPER)
  {
    gpio_init_structure.Pull = GPIO_PULLUP;
  }

  if(ButtonMode == BUTTON_MODE_GPIO)
  {
    /* Configure Button pin as input */
    gpio_init_structure.Mode = GPIO_MODE_INPUT;
    HAL_GPIO_Init(BUTTON_PORT [Button], &gpio_init_structure);
  }
  else /* (ButtonMode == BUTTON_MODE_EXTI) */
  {
    /* Configure Button pin as input with External interrupt */
    gpio_init_structure.Mode = GPIO_MODE_IT_RISING;

    HAL_GPIO_Init(BUTTON_PORT[Button], &gpio_init_structure);

    (void)HAL_EXTI_GetHandle(&hpb_exti[Button], BUTTON_EXTI_LINE[Button]);
    (void)HAL_EXTI_RegisterCallback(&hpb_exti[Button],  HAL_EXTI_COMMON_CB_ID, ButtonCallback[Button]);

    /* Enable and set Button EXTI Interrupt to the lowest priority */
    HAL_NVIC_SetPriority((BUTTON_IRQn[Button]), BSP_BUTTON_PRIO[Button], 0x00);
    HAL_NVIC_EnableIRQ((BUTTON_IRQn[Button]));
  }
  return BSP_ERROR_NONE;
}

/**
  * @brief  Push Button DeInit.
  * @param  Button Button to be configured
  *          This parameter can be one of the following values:
  *            @arg  BUTTON_USER: User Push Button
  *            @arg  BUTTON_TAMPER: Tamper Push Button
  *            @arg  BUTTON_WAKEUP: Wakeup Push Button
  * @note PB DeInit does not disable the GPIO clock
  * @retval BSP status
  */

