iNavFlight/inav/lib/main/STM32H7/Drivers/BSP/STM32H7B3I-EVAL/stm32h7b3i_eval.c
  /* Store Joystick pins initialized */
  JoyPinsMask |= (uint32_t)JoyPins;

  /* Initialized the Joystick. */
  for(joykey = 0U; joykey < JOY_KEY_NUMBER ; joykey++)
  {
    key_pressed = 1UL << joykey;
    if((key_pressed & (uint32_t)JoyPins) == key_pressed)
    {
      if(JOY == JOY1)
      {
      /* Enable the JOY clock */
        if(key_pressed == (uint32_t)JOY_SEL)
        {
          JOY1_SEL_GPIO_CLK_ENABLE();
        }
        else if(key_pressed == (uint32_t)JOY_DOWN)
        {
          JOY1_DOWN_GPIO_CLK_ENABLE();
        }
        else if(key_pressed == (uint32_t) JOY_LEFT)
        {
          JOY1_LEFT_GPIO_CLK_ENABLE();
        }
        else if(key_pressed == (uint32_t) JOY_RIGHT)
        {
          JOY1_RIGHT_GPIO_CLK_ENABLE();
        }
        else
        {
          if(key_pressed == (uint32_t) JOY_UP)
          {
            JOY1_UP_GPIO_CLK_ENABLE();
          }
        }

        gpio_init_structure.Pin = JOY1_PIN[joykey];
        gpio_init_structure.Pull = GPIO_NOPULL;
        gpio_init_structure.Speed = GPIO_SPEED_FREQ_VERY_HIGH;

        if (JoyMode == JOY_MODE_GPIO)
        {
          /* Configure Joy pin as input */
          gpio_init_structure.Mode = GPIO_MODE_INPUT;
          HAL_GPIO_Init(JOY1_PORT[joykey], &gpio_init_structure);
        }
        else /*(JoyMode == JOY_MODE_EXTI)*/
        {
          /* Configure Joy pin as input with External interrupt */
          gpio_init_structure.Mode = GPIO_MODE_IT_RISING;
          HAL_GPIO_Init(JOY1_PORT[joykey], &gpio_init_structure);

         (void)HAL_EXTI_GetHandle(&hExtiJoyHandle[joykey], JOY_EXTI_LINE[joykey]);
         (void)HAL_EXTI_RegisterCallback(&hExtiJoyHandle[joykey],  HAL_EXTI_COMMON_CB_ID, JoyCallback[joykey]);

          /* Enable and set Joy EXTI Interrupt to the lowest priority */
          HAL_NVIC_SetPriority((IRQn_Type)(JOY1_IRQn[joykey]), BSP_JOY_PRIO[joykey], 0x00);
          HAL_NVIC_EnableIRQ((IRQn_Type)(JOY1_IRQn[joykey]));
        }
      }
    }
  }

  return ret;
}


/**
  * @brief  DeInit joystick GPIOs.
  * @param  JOY instance
  * @note   JOY DeInit does not disable the MFX, just set the MFX pins in Off mode
  * @param  JoyPins joystick pins to be de-initialized
  * @retval BSP status
  */
int32_t BSP_JOY_DeInit(JOY_TypeDef JOY, JOYPin_TypeDef JoyPins)
{
  uint32_t joykey, key_pressed;

  /* Store Joystick pins initialized */
  JoyPinsMask &= (uint32_t)JoyPins;

  /* Initialized the Joystick. */
  for(joykey = 0U; joykey < JOY_KEY_NUMBER ; joykey++)
  {
    key_pressed = 1UL << joykey;
    if((key_pressed & (uint32_t)JoyPins) == key_pressed)
    {
      if(JOY == JOY1)
      {
        /* Disable the JOY clock */
        switch(key_pressed)
        {
          case JOY_SEL:
          JOY1_SEL_GPIO_CLK_DISABLE();
          break;

          case JOY_DOWN:
          JOY1_DOWN_GPIO_CLK_DISABLE();
          break;

          case JOY_LEFT:
          JOY1_LEFT_GPIO_CLK_DISABLE();
          break;

          case JOY_RIGHT:
          JOY1_RIGHT_GPIO_CLK_DISABLE();
          break;

          case JOY_UP:
          JOY1_UP_GPIO_CLK_DISABLE();
          break;
          default:
          break;
        }
        HAL_GPIO_DeInit(JOY1_PORT[joykey], JOY1_PIN[joykey]);
      }
    }
  }
  return BSP_ERROR_NONE;
}

/**
  * @brief  This function handles JOY keys interrupt request.
  * @param  JOY Joystick instance
  * @param  JoyPin Specifies the pin connected EXTI handler
  * @retval None
  */
void BSP_JOY_IRQHandler(JOY_TypeDef JOY, JOYPin_TypeDef JoyPin)
{
  if(JOY == JOY1)
  {
    HAL_EXTI_IRQHandler(&hExtiJoyHandle[POSITION_VAL((uint32_t)JoyPin)]);
  }
}

/**
  * @brief  BSP Joystick Callback.
  * @param  JOY Joystick instance
  * @param  JoyPin Specifies the pin connected EXTI line
  * @retval None.
  */
__weak void BSP_JOY_Callback(JOY_TypeDef JOY, uint32_t JoyPin)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(JOY);
  UNUSED(JoyPin);

  /* This function should be implemented by the user application.
     It is called into this driver when an event on JoyPin is triggered. */
}

/**
  * @brief  Returns the current joystick status.
  * @param  JOY Joystick instance
  * @retval BSP error code if value is negative or one of the following values:
  *            @arg  JOY_NONE
  *            @arg  JOY_SEL
  *            @arg  JOY_DOWN
  *            @arg  JOY_LEFT
  *            @arg  JOY_RIGHT
  *            @arg  JOY_UP
  */
int32_t BSP_JOY_GetState(JOY_TypeDef JOY)
{
  uint32_t joykey, key_pressed;
  for (joykey = 0U; joykey < JOY_KEY_NUMBER ; joykey++)
  {
    key_pressed = 1UL << joykey;
    if((key_pressed & JoyPinsMask) == key_pressed)
    {
      if(JOY == JOY1)
      {
        if (HAL_GPIO_ReadPin(JOY1_PORT[joykey], JOY1_PIN[joykey]) != GPIO_PIN_SET)
        {
          /* Return Code Joystick key pressed */
          return (int32_t)key_pressed;
        }
      }
    }
  }
  /* No Joystick key pressed */
  return (int32_t)JOY_NONE;
}
/**
  * @}
  */

/** @defgroup STM32H7B3I_EVAL_LOW_LEVEL_Private_Functions LOW LEVEL Private Functions
  * @{
  */
/**
  * @brief  JOY1 UP EXTI line detection callbacks.
  * @retval None
  */
static void JOY1_UP_EXTI_Callback(void)
{
  BSP_JOY_Callback(JOY1, JOY1_UP_PIN);
}

/**
  * @brief  JOY1 DOWN EXTI line detection callbacks.
  * @retval None
  */
static void JOY1_DOWN_EXTI_Callback(void)
{
  BSP_JOY_Callback(JOY1, JOY1_DOWN_PIN);
}

/**
  * @brief  JOY1 SEL EXTI line detection callbacks.
  * @retval None
  */
static void JOY1_SEL_EXTI_Callback(void)
{
  BSP_JOY_Callback(JOY1, JOY1_SEL_PIN);
}

/**
  * @brief  JOY1 LEFT EXTI line detection callbacks.
  * @retval None
  */
static void JOY1_LEFT_EXTI_Callback(void)
{
  BSP_JOY_Callback(JOY1, JOY1_LEFT_PIN);
}

/**
  * @brief  JOY1 RIGHT EXTI line detection callbacks.
  * @retval None
  */
static void JOY1_RIGHT_EXTI_Callback(void)
{
  BSP_JOY_Callback(JOY1, JOY1_RIGHT_PIN);
}
#endif /* USE_BSP_IO_CLASS */


/**
  * @brief  WAKEUP EXTI line detection callbacks.
  * @retval None
  */
static void BUTTON_WAKEUP_EXTI_Callback(void)
{
  BSP_PB_Callback(BUTTON_WAKEUP);
}

/**
  * @brief  TAMPER EXTI line detection callbacks.
  * @retval None
  */
static void BUTTON_TAMPER_EXTI_Callback(void)
{
  BSP_PB_Callback(BUTTON_TAMPER);
}

/**
  * @brief  KEY EXTI line detection callbacks.
  * @retval None
  */
static void BUTTON_USER_EXTI_Callback(void)
{
  BSP_PB_Callback(BUTTON_USER);
}

#if (USE_BSP_COM_FEATURE > 0)
/**
  * @brief  Initializes UART MSP.
  * @param  huart UART handle
  * @retval None
  */
static void USART1_MspInit(UART_HandleTypeDef *huart)
{
  GPIO_InitTypeDef gpio_init_structure;

